In [403]:
import pandas as pd
from sqlalchemy import create_engine
from pathlib import Path

In [404]:
# Replace BASE_DIR with the actual path to your project directory
BASE_DIR = Path("E:/Labmentrix/Projects/Project_8")

In [405]:
password = "Prince%4011981"
engine = create_engine(
    f"mysql+mysqlconnector://root:{password}@localhost:3306/tourism_db"
)

In [406]:
city = pd.read_excel(Path(BASE_DIR,r'data/raw/City.xlsx'))
city.to_sql("city", engine, if_exists="delete_rows", index=False)

9143

In [407]:
city = pd.read_excel(Path(BASE_DIR,r'data/raw/City.xlsx'))

In [408]:
import os
os.listdir(r"E:\Labmentrix\Projects\Project_8\data\raw")

['City.xlsx',
 'Continent.xlsx',
 'Country.xlsx',
 'Item.xlsx',
 'Mode.xlsx',
 'Region.xlsx',
 'Transaction.xlsx',
 'Type.xlsx',
 'User.xlsx']

In [409]:
# loading all the data set
continent = pd.read_excel(Path(BASE_DIR,r'data/raw/Continent.xlsx'))
country = pd.read_excel(Path(BASE_DIR,r'data/raw/Country.xlsx'))
item = pd.read_excel(Path(BASE_DIR,r'data/raw/Item.xlsx'))
visit_mode = pd.read_excel(Path(BASE_DIR,r'data/raw/Mode.xlsx'))
region = pd.read_excel(Path(BASE_DIR,r'data/raw/Region.xlsx'))
transaction = pd.read_excel(Path(BASE_DIR,r'data/raw/Transaction.xlsx'))
attraction_type = pd.read_excel(Path(BASE_DIR,r'data/raw/Type.xlsx'))
User = pd.read_excel(Path(BASE_DIR,r'data/raw/User.xlsx'))

In [410]:
# Importing all the data to mysql Database
continent.to_sql("continent", engine, if_exists="delete_rows", index=False)
country.to_sql("country", engine, if_exists="delete_rows", index=False)
item.to_sql("item", engine, if_exists="delete_rows", index=False)
visit_mode.to_sql("visit_mode", engine, if_exists="delete_rows", index=False)
region.to_sql("region", engine, if_exists="delete_rows", index=False)
transaction.to_sql("transaction", engine, if_exists="delete_rows", index=False)
attraction_type.to_sql("attraction_type", engine, if_exists="delete_rows", index=False)
User.to_sql("users", engine, if_exists="delete_rows", index=False)

33530

In [411]:
tables = [
    "city",
    "continent",
    "region",
    "country",
    "attraction_type",
    "visit_mode",
    "item",
    "users",
    "transaction"
]

In [412]:
for table in tables:
    df = pd.read_sql(f"SELECT COUNT(*) AS cnt FROM {table}", engine)
    print(table, df["cnt"][0])

city 9143
continent 6
region 22
country 165
attraction_type 17
visit_mode 6
item 30
users 33530
transaction 52930

In [413]:
query="select * from city limit 10"
pd.read_sql(query,engine)

   CityId         CityName  CountryId
0       0                -          0
1       1           Douala          1
2       2     South Region          1
3       3        N'Djamena          2
4       4           Kigali          3
5       5  Kigali Province          3
6       6      Addis Ababa          4
7       7            Karen          5
8       8            Kenya          5
9       9          Malindi          5

In [414]:
transaction.head(2)

,TransactionId,UserId,VisitYear,VisitMonth,VisitMode,AttractionId,Rating
0,3,70456,2022,10,2,640,5
1,8,7567,2022,10,4,640,5

In [415]:
query_join = """

select 
t.TransactionId,
t.UserId,
t.VisitYear,
t.VisitMonth,
t.Rating,


-- user geography IDs

u.CityId      AS user_city_id,
u.CountryId   AS user_country_id,
u.RegionId    AS user_region_id,
u.ContinentId AS user_continent_id,

-- user city name

uc.CityName   AS user_cityname,
ucn.Continent AS user_Continent,
ur.Region AS user_region,

-- visit mode

vm.VisitMode,

-- attraction details

i.Attraction,
at.AttractionType,
at.AttractionTypeId,

-- attraction geography

c.CityName AS attraction_cityname, 
co.Country, 
r.Region, 
cn.Continent


from transaction t
LEFT JOIN users u on t.UserId = u.UserID
LEFT JOIN city uc ON u.CityId = uc.CityId
LEFT JOIN continent ucn on u.ContinentId = ucn.ContinentId
LEFT JOIN region ur ON u.RegionId = ur.RegionId
LEFT Join visit_mode vm on t.VisitMode = vm.VisitModeId
LEFT JOIN item i on t.AttractionId = i.AttractionId
LEFT JOIN attraction_type at on i.AttractionTypeId = at.AttractionTypeId
LEFT JOIN city c ON i.AttractionCityId = c.CityId
LEFT JOIN country co ON c.CountryId = co.CountryId
LEFT JOIN region r ON co.RegionId = r.RegionId
LEFT JOIN continent cn ON r.ContinentId = cn.ContinentId

"""

In [416]:
merged_data=pd.read_sql(query_join, engine)
merged_data.head(2)

,TransactionId,UserId,VisitYear,VisitMonth,Rating,user_city_id,user_country_id,user_region_id,user_continent_id,user_cityname,user_Continent,user_region,VisitMode,Attraction,AttractionType,AttractionTypeId,attraction_cityname,Country,Region,Continent
0,3,70456,2022,10,5,4341.0,163,21,5,Guildford,Europe,Western Europe,Couples,Sacred Monkey Forest Sanctuary,Nature & Wildlife Areas,63,Douala,Cameroon,Central Africa,Africa
1,8,7567,2022,10,5,464.0,48,8,2,Ontario,America,Northern America,Friends,Sacred Monkey Forest Sanctuary,Nature & Wildlife Areas,63,Douala,Cameroon,Central Africa,Africa

In [417]:
tables = [
    "city",
    "continent",
    "region",
    "country",
    "attraction_type",
    "visit_mode",
    "item",
    "users",
    "transaction"
]

In [418]:
city.tail(1)

      CityId CityName  CountryId
9142    9142    Sanaa        164

In [419]:
continent.tail(1)

   ContinentId Continent
5            5    Europe

In [420]:
region.tail(1)

            Region  RegionId  ContinentId
21  Western Europe        21            5

In [421]:
country.tail(1)

     CountryId Country  RegionId
164        164   Yemen        12

In [422]:
attraction_type.tail(1)

    AttractionTypeId AttractionType
16                93     Waterfalls

In [423]:
visit_mode.tail(1)

   VisitModeId VisitMode
5            5      Solo

In [424]:
item.tail(1)

,AttractionId,AttractionCityId,AttractionTypeId,Attraction,AttractionAddress
29,1297,3,44,Yogyakarta Palace,Yogyakarta

In [425]:
User.tail(1)

       UserId  ContinentId  RegionId  CountryId  CityId
33529   88190            5        21        159  7494.0

In [426]:
transaction.tail(1)

,TransactionId,UserId,VisitYear,VisitMonth,VisitMode,AttractionId,Rating
52929,211241,88112,2016,2,2,1297,5

In [427]:
# from transaction data these columns required: UserId	VisitYear	VisitMonth	VisitMode	AttractionId	Rating
# from User data these columns required: UserId	ContinentId	RegionId	CountryId	CityId
# from items data these columns required : AttractionId	AttractionCityId	AttractionTypeId
# from visit mode date these columns required : VisitModeId (VisitmodeID = visitmode in transaction )
# from attraction type these columns required : 	None (as it gives only attraction type name for attraction type id  but we will using int anyway for ML and other inferences )
# from country data need to map User country and Attraction country 
# from region data need to map user region and attraction region
# from region data need to map user region and attraction region
# from continent data need to map user continent and attraction continent
# from city data need to map user city and user continent

In [428]:
query_final = """
select 
t.TransactionId,
t.UserId,
t.VisitYear,
t.VisitMonth,
t.VisitMode,
t.Rating,

# user demogrphic data

u.ContinentId AS user_continent_id,
u.RegionId      AS user_region_id,
u.CountryId     AS user_country_id,
u.CityId        AS user_city_id,

-- attraction demograhic data

i.AttractionId,
i.AttractionCityId,
i.AttractionTypeId,
c.CountryId     AS attraction_countryid,
co.RegionId      AS attraction_regionid,
r.ContinentId   AS attraction_continentid

from transaction t
LEFT JOIN users u on t.UserId = u.UserID
LEFT JOIN item i on t.AttractionId = i.AttractionId
LEFT JOIN city c on i.AttractionCityId = c.CityId
LEFT JOIN country co on c.CountryId = co.CountryId
LEFT JOIN region r on co.RegionId = r.RegionId

"""

In [429]:
# as we will need data in number format for ML and clustring hence used only ids for dataset
numeric_data_id=pd.read_sql(query_final, engine)

In [430]:
numeric_data_id

,TransactionId,UserId,VisitYear,VisitMonth,VisitMode,Rating,user_continent_id,user_region_id,user_country_id,user_city_id,AttractionId,AttractionCityId,AttractionTypeId,attraction_countryid,attraction_regionid,attraction_continentid
0,3,70456,2022,10,2,5,5,21,163,4341.0,640,1,63,1,1,1
1,8,7567,2022,10,4,5,2,8,48,464.0,640,1,63,1,1,1
2,9,79069,2022,10,3,5,2,9,54,774.0,640,1,63,1,1,1
3,10,31019,2022,10,3,3,5,17,135,583.0,640,1,63,1,1,1
4,15,43611,2022,10,2,3,5,21,163,1396.0,640,1,63,1,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
52925,211227,87100,2018,9,2,4,5,21,159,7460.0,1297,3,44,2,1,1
52926,211238,88112,2016,2,2,5,5,17,133,6164.0,1297,3,44,2,1,1
52927,211239,88112,2016,2,2,4,5,17,133,6164.0,1297,3,44,2,1,1
52928,211240,88112,2016,2,2,4,5,17,133,6164.0,1297,3,44,2,1,1
52929,211241,88112,2016,2,2,5,5,17,133,6164.0,1297,3,44,2,1,1

In [431]:
numeric_data_id.to_csv(Path(BASE_DIR,r"data\processed\numeric_data.csv"))